app/Controllers/Books.php

    public function create()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return $this->respond([
                'status' => 'error',
                'message' => 'Harus login terlebih dahulu'
            ], 401);
        }

        $model = new BookModel();
        $data = [
            'judul_buku' => $this->request->getVar('judul_buku'),
            'penerbit' => $this->request->getVar('penerbit'),
            'tahun_terbit' => $this->request->getVar('tahun_terbit'),
            'created_by' => $session->get('user_id')
        ];

        if ($model->save($data)) {
---
INSERT INTO `books` (`judul_buku`, `penerbit`, `tahun_terbit`, `created_by`) VALUES ('akulah serigala', 'Ganteng ganteng  sakit', '2000', '1')

    public function delete($id = null)
    {
        $session = session();

        if (!$session->get('logged_in')) {
            return $this->respond([
                'status' => 'error',
                'message' => 'Harus login terlebih dahulu'
            ], 401);
        }

        $model = new BookModel();
        if ($model->delete($id)) {
---
DELETE FROM `books`
WHERE `id` IN ('3')