app/Controllers/Test.php

SELECT *
FROM `users`
---
    public function users()
    {
        try {
            // Cek apakah model UserModel ada
            if (!class_exists('\App\Models\UserModel')) {
                return $this->responseJSON([
                    'status' => false,
                    'message' => 'UserModel tidak ditemukan'
                ], 404);
            }

            $userModel = new \App\Models\UserModel();
            $users = $userModel->findAll();

SELECT *
FROM `books`
---
    public function books()
    {
        try {
            // Option 1: Menggunakan model buku jika ada
            if (class_exists('\App\Models\BookModel')) {
                $bookModel = new \App\Models\BookModel();
                $books = $bookModel->findAll();